CrosswordWidth = 20;
	CrosswordHeight = 15;
	Words = 18;
	WordLength = new Array(5, 6, 4, 3, 5, 7, 9, 7, 5, 5, 7, 5, 13, 5, 5, 6, 5, 6);
	Word = new Array("КНЯЗЬ", "БОБЫЛИ", "ТАРА", "ЛУК", "ОФЕНЯ", "СЛОБОДА", "МИНИАТЮРА", "ВЫШИВКА", "КУПЕЦ", "ПАНИН", "ГОЛЫШЕВ", "ИКОНА", "РОМОДАНОВСКИЙ", "САЗАН", "БАЗАР", "КЕСАРЬ", "МУЗЕЙ", "ЮВЕЛИР");
	Clue = new Array("Глава феодального монархического государства", 
"Одинокий крестьянин, не имеющий земельного надела", 
"Река вязниковского района, никогда не замерзает", 
"Сидит дед во сто шуб одет, кто его раздевает тот слезы проливает", 
"Человек странствующий по деревням торгующий разным товаром", 
"Вид поселения или района города", 
"Произведение искусства малых форм?", 
"Вид декоративно-прикладного искусства, в котором узор и изображение выполняются вручную иглой", 
"Человек (торговец), занятый в сфере торговли, купли-продажи", 
"Граф, владелец слободы Мстёра?", 
"Житель слободы Мстёры археолог-любитель, краевед, литограф, издатель", 
"Священное изображение лиц или событий библейской или церковной истории на липовой доске", 
"Княжеский род владельцев слободы Мстёры", 
"Вид пресноводных лучепёрых рыб семейства карповых? Шуточное название местных жителей", 
"Торговое бойкое место?", 
"Титул князя Фёдора Юрьевича Ромодановского", 
"Учреждение, занимающееся сбором, изучением, хранением и экспонированием предметов", 
"Человек специализирующийся на работе с золотом и другими драгоценными металлами");
	AnswerHash = new Array(10502, 61535, 24370, 75604, 41795, 2656, 62129, 31483, 21446, 87181, 22590, 45420, 46478, 40981, 72400, 85943, 24635, 88527);
	WordX = new Array(1, 14, 0, 7, 15, 9, 1, 11, 15, 8, 17, 1, 15, 3, 5, 9, 1, 11);
	WordY = new Array(2, 3, 5, 5, 5, 7, 8, 10, 12, 13, 0, 1, 2, 4, 5, 5, 8, 9);
	LastHorizontalWord = 9;
	OnlyCheckOnce = false;